---
type: BumpMap
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 14
tags: [revit-api, class]
---

# BumpMap

`Autodesk.Revit.DB.Visual.BumpMap` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | BumpmapBitmap | 2018.1 | `public static string BumpmapBitmap { get ; }` |
| Property | BumpmapDepth | 2018.1 | `public static string BumpmapDepth { get ; }` |
| Property | BumpmapNormalScale | 2018.1 | `public static string BumpmapNormalScale { get ; }` |
| Property | BumpmapType | 2018.1 | `public static string BumpmapType { get ; }` |
| Property | TextureLinkTextureTransforms | 2018.1 | `public static string TextureLinkTextureTransforms { get ; }` |
| Property | TextureOffsetLock | 2018.1 | `public static string TextureOffsetLock { get ; }` |
| Property | TextureRealWorldOffsetX | 2018.1 | `public static string TextureRealWorldOffsetX { get ; }` |
| Property | TextureRealWorldOffsetY | 2018.1 | `public static string TextureRealWorldOffsetY { get ; }` |
| Property | TextureRealWorldScaleX | 2018.1 | `public static string TextureRealWorldScaleX { get ; }` |
| Property | TextureRealWorldScaleY | 2018.1 | `public static string TextureRealWorldScaleY { get ; }` |
| Property | TextureScaleLock | 2018.1 | `public static string TextureScaleLock { get ; }` |
| Property | TextureURepeat | 2018.1 | `public static string TextureURepeat { get ; }` |
| Property | TextureVRepeat | 2018.1 | `public static string TextureVRepeat { get ; }` |
| Property | TextureWAngle | 2018.1 | `public static string TextureWAngle { get ; }` |